ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>бг_АктОбУничтоженииФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ДобавлениеНовойПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияАктаОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияПланируемогоВвоза</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_КвитанцияОтчетОбИспользованииФСМ</name>
    <comment>ReportUsingFSM</comment>
  </enumValues>
  <enumValues>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтветНаЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОбИмпортеПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОПроизводствеЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ПланируемыйВвозЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ФорматыОбменаЕГАИС/ФорматыОбменаЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФорматыОбменаЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>V1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>V2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>V3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>V4</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>V5</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

&Вместо("ТаблицаСоответствияДокументовТипамЕГАИС")
Функция бг_ТаблицаСоответствияДокументовТипамЕГАИС() Экспорт
	
	Таблица = ПродолжитьВызов();
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ClaimIssueFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗаявлениеОВыдачеФСМ;
	НоваяСтрока.ПространствоИмен  = "ClaimIssueFSM";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("TTNIssueFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_НакладнаяНаВыдачуФСМ;
	НоваяСтрока.ПространствоИмен  = "TTNIssueFSM";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepImportedProduct_v4");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтчетОбИмпортеПродукцииЕГАИС;
	НоваяСтрока.ПространствоИмен  = "RepImportedProduct_v4";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepProducedProduct_v5");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V5;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтчетОПроизводствеЕГАИС;
	НоваяСтрока.ПространствоИмен  = "RepProducedProduct_v5";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RepInformF1Reg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве;
	НоваяСтрока.ПространствоИмен  = "RepInformF1Reg";

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QueryRejectRepImported");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте;
	НоваяСтрока.ПространствоИмен  = "QueryRejectRepImported";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QueryRejectRepProduced");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве;
	НоваяСтрока.ПространствоИмен  = "QueryRejectRepProduced";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RequestRepealIPI");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросНаОтменуПроведенияПланируемогоВвоза;
	НоваяСтрока.ПространствоИмен  = "RequestRepealIPI";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("QuerySSP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ЗапросССП;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ReplySSP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ОтветНаЗапросССП;

	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("RequestAddProducts");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ДобавлениеНовойПродукцииЕГАИС;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("InvoicePlannedImport");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_ПланируемыйВвозЕГАИС;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = ("ReportDestructionAMFSM");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_АктОбУничтоженииФСМ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС          = "FrapClaims";
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V4;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС;
	
	Возврат Таблица;
	
КонецФункции	

&Вместо("ПрефиксПространстваИмен")
Функция бг_ПрефиксПространстваИмен(ПространствоИмен) Экспорт
	
	Если ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClaimIssueFSM") Тогда
		Возврат "fsm";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/FrapClaims") Тогда
		Возврат "nbt";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/InvoicePlannedImport") Тогда
		Возврат "ipi";
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RepProducedProduct_v5") Тогда
		Возврат "rpp";
	Иначе
		Возврат ПродолжитьВызов(ПространствоИмен);
	КонецЕсли;	

КонецФункции

#КонецОбласти
